package bg.tu_varna.sit.f24621702.task.states;

/**
 * Интерфейс, дефиниращ общото поведение за различните състояния на файловия мениджър (State Pattern).
 * Всяко състояние имплементира специфична логика за основните файлови операции.
 */
public interface FileState {
    /**
     * Дефинира поведението при извеждане на списък с автомати в текущото състояние.
     */
    void list();

    /**
     * Дефинира поведението при запис на промените в текущото състояние.
     */
    void save();

    /**
     * Опит за отваряне на нов файл.
     * @param fileName Име на файла, който се прави опит да бъде отворен.
     */
    void open(String fileName);
}